In [1]:
import pandas as pd
import numpy as np

In [2]:
# Numpy for creating random number
np.random.seed(101)
data = np.random.rand(4,5)

In [3]:
data

array([[0.51639863, 0.57066759, 0.02847423, 0.17152166, 0.68527698],
       [0.83389686, 0.30696622, 0.89361308, 0.72154386, 0.18993895],
       [0.55422759, 0.35213195, 0.1818924 , 0.78560176, 0.96548322],
       [0.23235366, 0.08356143, 0.60354842, 0.72899276, 0.27623883]])

In [4]:
# Now let Change this data into a dataframe
df = pd.DataFrame(data=(data))

In [5]:
df

          0         1         2         3         4
0  0.516399  0.570668  0.028474  0.171522  0.685277
1  0.833897  0.306966  0.893613  0.721544  0.189939
2  0.554228  0.352132  0.181892  0.785602  0.965483
3  0.232354  0.083561  0.603548  0.728993  0.276239

In [10]:
# Now lets set the name for the Indexes and Columns
df = pd.DataFrame(data = (data) ,index = ('A B C D').split(), columns = ('V W X Y Z').split())

In [12]:
# Note split is method 
('A B C D').split()

['A', 'B', 'C', 'D']

In [14]:
# Here is The DataFrame with indexes and columns name
df

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939
C  0.554228  0.352132  0.181892  0.785602  0.965483
D  0.232354  0.083561  0.603548  0.728993  0.276239

In [15]:
# Calling a single and multiple columns from DataFrame
df['V']

A    0.516399
B    0.833897
C    0.554228
D    0.232354
Name: V, dtype: float64

In [17]:
df[['V','W']]

          V         W
A  0.516399  0.570668
B  0.833897  0.306966
C  0.554228  0.352132
D  0.232354  0.083561

In [25]:
# Lets create a new column inside the DataFrame
df['NEW'] = df['V'] + df['W']
df

          V         W         X         Y         Z       NEW
A  0.516399  0.570668  0.028474  0.171522  0.685277  1.087066
B  0.833897  0.306966  0.893613  0.721544  0.189939  1.140863
C  0.554228  0.352132  0.181892  0.785602  0.965483  0.906360
D  0.232354  0.083561  0.603548  0.728993  0.276239  0.315915

In [19]:
# Now lets delete the NEW column from the DataFrame
df.drop('NEW',axis=1)

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939
C  0.554228  0.352132  0.181892  0.785602  0.965483
D  0.232354  0.083561  0.603548  0.728993  0.276239

In [21]:
df

          V         W         X         Y         Z       NEW
A  0.516399  0.570668  0.028474  0.171522  0.685277  1.087066
B  0.833897  0.306966  0.893613  0.721544  0.189939  1.140863
C  0.554228  0.352132  0.181892  0.785602  0.965483  0.906360
D  0.232354  0.083561  0.603548  0.728993  0.276239  0.315915

In [26]:
# We can still see the New column inside the DataFrame to permantly delete it we have set inplace TRUE
df.drop('NEW', axis=1, inplace=True)
df

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939
C  0.554228  0.352132  0.181892  0.785602  0.965483
D  0.232354  0.083561  0.603548  0.728993  0.276239

In [27]:
#See NEW column is permantly deleted
df

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939
C  0.554228  0.352132  0.181892  0.785602  0.965483
D  0.232354  0.083561  0.603548  0.728993  0.276239

In [28]:
#Calling a single and multiple Rows from DataFrame using (loc) = Location
df.loc['A']

V    0.516399
W    0.570668
X    0.028474
Y    0.171522
Z    0.685277
Name: A, dtype: float64

In [30]:
df.loc[['A','B']]

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939

In [33]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.171522  0.685277
B  0.721544  0.189939

In [31]:
#Calling a single and multiple Rows from DataFrame using (iloc) = index location
df.iloc[0]

V    0.516399
W    0.570668
X    0.028474
Y    0.171522
Z    0.685277
Name: A, dtype: float64

In [32]:
df.iloc[[0,1]]

          V         W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522  0.685277
B  0.833897  0.306966  0.893613  0.721544  0.189939

In [34]:
df.iloc[[0,1],[3,4]]

          Y         Z
A  0.171522  0.685277
B  0.721544  0.189939

In [44]:
# Conditional Selection
df['W']>0

A    True
B    True
C    True
D    True
Name: W, dtype: bool

In [50]:
# Lets create another DataFrame to work on because this DataFrame have all the values above from 0
df_2 = np.random.randn(4,5)
df_2

array([[ 0.99257345,  1.19224064, -1.04677954,  1.29276458, -1.46751402],
       [-0.49409536, -0.16253473,  0.48580874,  0.39248881,  0.22149069],
       [-0.85519604,  1.54199041,  0.66631932, -0.53823463, -0.56858136],
       [ 1.40733825,  0.64180551, -0.9050999 , -0.39115663,  1.02829316]])

In [51]:
# Lets transform it into a DataFrame
df_2 = pd.DataFrame(df_2, index=('A B C D').split(), columns=('V W X Y Z').split())
df_2

          V         W         X         Y         Z
A  0.992573  1.192241 -1.046780  1.292765 -1.467514
B -0.494095 -0.162535  0.485809  0.392489  0.221491
C -0.855196  1.541990  0.666319 -0.538235 -0.568581
D  1.407338  0.641806 -0.905100 -0.391157  1.028293

In [52]:
#So here we have on false value in the column which means it less than zero
df_2['W']>0

A     True
B    False
C     True
D     True
Name: W, dtype: bool

In [62]:
#Now lets try multiple condition
df_2[(df_2['W']>0) & (df_2['V']>1)]

          V         W       X         Y         Z
D  1.407338  0.641806 -0.9051 -0.391157  1.028293

In [63]:
df_2

          V         W         X         Y         Z
A  0.992573  1.192241 -1.046780  1.292765 -1.467514
B -0.494095 -0.162535  0.485809  0.392489  0.221491
C -0.855196  1.541990  0.666319 -0.538235 -0.568581
D  1.407338  0.641806 -0.905100 -0.391157  1.028293

In [66]:
# Lets change the index names for the df_2
name = ('PAK CHINA USA USSR').split()

In [68]:
df_2['Country'] = name

In [69]:
df_2

          V         W         X         Y         Z Country
A  0.992573  1.192241 -1.046780  1.292765 -1.467514     PAK
B -0.494095 -0.162535  0.485809  0.392489  0.221491   CHINA
C -0.855196  1.541990  0.666319 -0.538235 -0.568581     USA
D  1.407338  0.641806 -0.905100 -0.391157  1.028293    USSR

In [71]:
df_2.set_index('Country')

                V         W         X         Y         Z
Country
PAK      0.992573  1.192241 -1.046780  1.292765 -1.467514
CHINA   -0.494095 -0.162535  0.485809  0.392489  0.221491
USA     -0.855196  1.541990  0.666319 -0.538235 -0.568581
USSR     1.407338  0.641806 -0.905100 -0.391157  1.028293